---
kind: property
id: P:Autodesk.Revit.DB.CombinableElementArray.Size
source: html/3e89356a-f974-728b-9e94-ac267b7c2d76.htm
---
# Autodesk.Revit.DB.CombinableElementArray.Size Property

Returns the number of CombinableElements that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```